## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:55" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:55" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:28925943e97fe2b2a2c4b1ebe88b08d033acb68ec55d8d8ff4b17856aea60e5b" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:34bc654c3778ff1644e4f99d6efe6f00846deba7ef5bb09ba7ce2ac0db4f6090"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 55 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "c3faa07aa23dbaf9d25281622152bc55-5" -> "1e4683cb85e97d3200d97928196ea632"
        id                     = "cpfValidation.1e4683cb85e97d3200d97928196ea632.zip"
        tags                   = {}
      ~ version_id             = "bBkIDmPfo3_Dpb5GaMyEsQeJTtdRS9Hs" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "46bd4905044bdd17d1d04ca5c42f955f-6" -> "db2decf258f703af202a664d565cbcd6"
        id                     = "excelToJson.db2decf258f703af202a664d565cbcd6.zip"
        tags                   = {}
      ~ version_id             = "wmWh14ANII8tElOMJGzXpiwr_VsBzat6" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "7cf256a1d44995e79f176a6ef26d3845-6" -> "44abb52be7f724834176744013026748"
        id                     = "graphql.44abb52be7f724834176744013026748.zip"
        tags                   = {}
      ~ version_id             = "NGcEG3B9us_K2Wg982uVACpg8eK5TJU0" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ee921eae0d30acfdf5ddb2a190eae414" -> "8e2d941391344bcab7e6b2d9f25c9adc"
        id                     = "dist/200.html"
      ~ source_hash            = "ee921eae0d30acfdf5ddb2a190eae414" -> "8e2d941391344bcab7e6b2d9f25c9adc"
        tags                   = {}
      ~ version_id             = "NCfHVKhRP8k5eRJXmZWh4fQ861kXLVw2" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "36c8b4b5a03cd73307a0f3601badac27" -> "9bf377b8b535c7e68273b3437f4c6e11"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "36c8b4b5a03cd73307a0f3601badac27" -> "9bf377b8b535c7e68273b3437f4c6e11"
        tags                   = {}
      ~ version_id             = "DA19PCozh.I3eCCa41m9fMcwfjavxHtx" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "e983b6cd734ee0b77a20b0598863a454" -> "94f081a63365905b2cd602ea71b8105f"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "e983b6cd734ee0b77a20b0598863a454" -> "94f081a63365905b2cd602ea71b8105f"
        tags                   = {}
      ~ version_id             = "OXyER3RqZCtamMt2mrmjeAQJyWDSoMf7" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ee921eae0d30acfdf5ddb2a190eae414" -> "8e2d941391344bcab7e6b2d9f25c9adc"
        id                     = "dist/index.html"
      ~ source_hash            = "ee921eae0d30acfdf5ddb2a190eae414" -> "8e2d941391344bcab7e6b2d9f25c9adc"
        tags                   = {}
      ~ version_id             = "ON_DQl4xUXSWTL9Y3_M3v1UjAgoJnYd4" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.38202ff3.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "49b58ecfec104f953c242172d53293bf"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.38202ff3.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.38202ff3.js"
+       source_hash            = "49b58ecfec104f953c242172d53293bf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.38202ff3.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.38202ff3.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.38202ff3.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.fa5e4bb0.js"] will be destroyed
  # (because key ["static/js/app.fa5e4bb0.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "cb283a816d89a822d4cfc72a7f70cdd7" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.fa5e4bb0.js" -> null
-       key                    = "dist/static/js/app.fa5e4bb0.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.fa5e4bb0.js" -> null
-       source_hash            = "cb283a816d89a822d4cfc72a7f70cdd7" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "0HGvD4SFH0Ag.XAZPfYjDWXIOY48K19D" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.fa5e4bb0.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.fa5e4bb0.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.fa5e4bb0.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.fa5e4bb0.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.fa5e4bb0.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "I6q3wHAfiGBuGee2Ow_PVBJUquZ6DhJ." -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:24" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:24/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "24" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "f7fb563c187acf108999e64831e48e14799b9121" -> "f68af6946f4e5c967c623f13a6505a9d7752990a"
              ~ "DD_TAGS"                      = "git.commit.sha:f7fb563c187acf108999e64831e48e14799b9121,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:f68af6946f4e5c967c623f13a6505a9d7752990a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "f7fb563c187acf108999e64831e48e14799b9121" -> "f68af6946f4e5c967c623f13a6505a9d7752990a"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "24" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:24" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:24/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "24" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "f7fb563c187acf108999e64831e48e14799b9121" -> "f68af6946f4e5c967c623f13a6505a9d7752990a"
              ~ "DD_TAGS"                      = "git.commit.sha:f7fb563c187acf108999e64831e48e14799b9121,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:f68af6946f4e5c967c623f13a6505a9d7752990a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "f7fb563c187acf108999e64831e48e14799b9121" -> "f68af6946f4e5c967c623f13a6505a9d7752990a"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "24" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:71" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:71/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "71" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "f7fb563c187acf108999e64831e48e14799b9121" -> "f68af6946f4e5c967c623f13a6505a9d7752990a"
              ~ "DD_TAGS"                            = "git.commit.sha:f7fb563c187acf108999e64831e48e14799b9121,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:f68af6946f4e5c967c623f13a6505a9d7752990a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "f7fb563c187acf108999e64831e48e14799b9121" -> "f68af6946f4e5c967c623f13a6505a9d7752990a"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "71" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 11 to change, 6 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8310579149)*